[
  {
    "id": 3,
    "url": "https://www.coindesk.com/markets/2025/06/09/trump-media-and-semler-scientific-could-be-cheapest-bitcoin-treasury-companies-by-this-metric",
    "title": "Trump Media and Semler Scientific Could Be Cheapest Bitcoin Treasury Companies by This Metric",
    "content": "A tsunami of new bitcoin BTC$108,601.20 treasury companies — firms that almost exclusively dedicate themselves to accumulating bitcoin — is flooding the market.\n\nSince all of them are more or less following Strategy’s (MSTR) playbook, questions are rising about the best ways to value them, and compare them to each other.\n\n“The most important metric for a bitcoin treasury is the premium it trades at relative to its underlying net assets, including any operating company,” Greg Cipolaro, global head of research at bitcoin financial firm NYDIG, wrote in a June 6 report.\n\nOn the surface, that means adding up the company’s bitcoin, cash and enterprise value excluding the bitcoin stuff, and subtracting obligations such as debt and preferred stock. “It’s this premium that allows these companies to convert stock for bitcoins, effectively acting as a money changer converting shares for bitcoins,” Cipolaro said.\n\nOne of the most popular metrics, mNAV, measures a company’s valuation to its net asset value — in these cases, their bitcoin treasuries. An mNAV above 1.0 signals that investors are interested in paying a premium for exposure to the stock relative to its bitcoin stash; however, an mNAV below 1.0 means the equity is now worth less than the company’s holdings.\n\nBut mNAV alone is “woefully deficient” to analyze the strengths and weaknesses of these firms, Cipolaro said. The research report made use of other metrics such as NAV, mNAV measured by market capitalization, mNAV by enterprise value, and equity premium to NAV to provide a more complex picture.\n\nThe table shows, for example, that Semler Scientific’s (SMLR) and Trump Media’s (DJT) equity premium to NAV (which measures the percentage difference between a fund's market price and its net asset value), are the lowest of the eight measured companies, coming in at -10% and -16% respectively, despite the fact that both companies have an mNAV above 1.1.\n\nAlas, both SMLR and DJT are little-changed on Monday even as bitcoin climbs to $108,500 versus Friday evening's $105,000 level. MSTR is higher by just shy of 5%.\n\nTom writes about markets, bitcoin mining and crypto adoption in Latin America. He has a bachelor's degree in English literature from McGill University, and can usually be found in Costa Rica. He holds BTC above CoinDesk's disclosure threshold of $1,000.",
    "author": "Неизвестен автор",
    "published_date": "2025-06-09",
    "scraped_at": "2025-06-09 19:24:52",
    "content_length": 2348,
    "processed": 1,
    "analyzed_at": "2025-06-09 19:25:12",
    "sentiment_result": "{\"sentiment\": \"positive\", \"confidence\": 0.85, \"summary\": \"Positive article about crypto markets\"}"
  }
]